[
  {
    "@context": "https://schema.org",
    "@type": "FAQPage",
    "mainEntity": [
      {
        "@type": "Question",
        "name": "What are open source grants?",
        "acceptedAnswer": {
          "@type": "Answer",
          "text": "Open source grants are financial support programs provided by organizations, foundations, or companies to help maintain or enhance open source projects. These grants ensure the sustainability of open source ecosystems, reward contributors, and encourage innovation."
        }
      },
      {
        "@type": "Question",
        "name": "Who provides open source grants?",
        "acceptedAnswer": {
          "@type": "Answer",
          "text": "Open source grants are provided by nonprofit foundations like the Mozilla Foundation, Linux Foundation, Open Source Collective; tech companies like Google, GitHub, Facebook, and Microsoft; crowdfunding platforms such as GitHub Sponsors, Open Collective, and Patreon; and cross-industry initiatives like the Apache Software Foundation."
        }
      },
      {
        "@type": "Question",
        "name": "What are some examples of open source grant programs?",
        "acceptedAnswer": {
          "@type": "Answer",
          "text": "Examples of open source grant programs include The GitHub Sponsors Program, NLNet Foundation Grants, and Open Technology Fund. These programs provide funding for developers and projects that align with specific focus areas like privacy, security, and open internet solutions."
        }
      },
      {
        "@type": "Question",
        "name": "How can developers benefit from open source grants?",
        "acceptedAnswer": {
          "@type": "Answer",
          "text": "Open source grants enable developers to work on their projects consistently without the pressure of direct monetization. They also ensure visibility for niche tools and encourage diversity and accessibility in the open source community by supporting underrepresented groups."
        }
      },
      {
        "@type": "Question",
        "name": "How can developers apply for open source grants?",
        "acceptedAnswer": {
          "@type": "Answer",
          "text": "To apply for open source grants, developers should identify programs aligned with their project goals, prepare a strong project pitch, include roadmaps and sustainability plans, and demonstrate past contributions or community feedback."
        }
      }
    ]
  }
]