{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What are CyberKongz?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "CyberKongz are a collection of 10,000 unique, algorithmically generated gorilla-themed NFTs created on the Ethereum blockchain. They feature unique artwork and play-to-earn features, allowing owners to monetize their NFTs within gaming ecosystems."
      }
    },
    {
      "@type": "Question",
      "name": "What are the key features of CyberKongz?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The key features include gorilla-themed art, play-to-earn mechanics, interoperability across different platforms, and community-driven development."
      }
    },
    {
      "@type": "Question",
      "name": "How can I purchase CyberKongz NFTs?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "CyberKongz NFTs can be purchased on OpenSea. Users need to create a digital wallet, fund it with Ethereum, connect it to OpenSea, browse and select CyberKongz NFTs, and complete the purchase through their wallet."
      }
    },
    {
      "@type": "Question",
      "name": "What is the significance of play-to-earn in CyberKongz?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Play-to-earn allows CyberKongz owners to participate in games and earn rewards, enhancing the utility and value of their NFTs by engaging in interactive experiences."
      }
    },
    {
      "@type": "Question",
      "name": "How does CyberKongz ensure community involvement?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "CyberKongz fosters community involvement through events, updates, voting mechanisms, and active engagement across social media platforms, ensuring project development aligns with community interests."
      }
    },
    {
      "@type": "Question",
      "name": "What future developments are planned for CyberKongz?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Future developments include enhanced play-to-earn features, strategic collaborations, exclusive drops, and the exploration of augmented and virtual reality experiences."
      }
    },
    {
      "@type": "Question",
      "name": "What sets CyberKongz apart from other NFT collections?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "CyberKongz stands out for its unique gorilla-themed NFTs, play-to-earn mechanics, strong community involvement, and interoperability across various platforms in the NFT ecosystem."
      }
    }
  ]
}