{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What is Gitcoin?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Gitcoin is an Ethereum-based platform launched in 2017 that supports open source projects through various innovative funding mechanisms including bounties, hackathons, and Gitcoin Grants. It aims to financially sustain open source projects, while enabling developers to gain recognition, economic empowerment, and career growth."
      }
    },
    {
      "@type": "Question",
      "name": "What is the goal of Gitcoin Grants?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The goal of Gitcoin Grants is to fund open source projects using a community-driven model called Quadratic Funding. This model ensures a fair allocation of resources so that projects with broad community appeal receive appropriate funding."
      }
    },
    {
      "@type": "Question",
      "name": "How does Quadratic Funding work?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Quadratic Funding combines a matching pool with individual donations. It calculates matching funds by squaring the sum of the square roots of each contribution, enhancing the impact of smaller donations while reducing the influence of larger ones. This distribution model encourages more community involvement in funding decisions."
      }
    },
    {
      "@type": "Question",
      "name": "What is the impact of Gitcoin Grants on the open source ecosystem?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Gitcoin Grants significantly impacts the open source ecosystem by fostering community-driven development, diversifying the types of funded projects, empowering developers, enhancing collaboration, and promoting sustainability in open source development."
      }
    },
    {
      "@type": "Question",
      "name": "What challenges does Gitcoin face?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Gitcoin faces challenges such as preventing collusion among donors, ensuring equitable fund distribution, adapting to regulatory changes, and maintaining a balance between decentralization and governance as the platform grows."
      }
    },
    {
      "@type": "Question",
      "name": "What are the future prospects for Gitcoin Grants?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Despite challenges, Gitcoin Grants has promising prospects with its potential to innovate funding models and integrate traditional and blockchain funding sources. It seeks to contribute to the future of digital collaboration by adequately funding open source projects and empowering developers to address global technological challenges."
      }
    }
  ]
}