{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What is Gitcoin?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Gitcoin is a platform designed to support open-source software through funding mechanisms like Bounties, Grants, and Hackathons. It connects developers with resources to foster collaboration and innovation in the open-source community."
      }
    },
    {
      "@type": "Question",
      "name": "How do I set up an account on Gitcoin?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Visit Gitcoin's website and sign up with your GitHub account. Completing your profile with your skills and interests can help attract relevant opportunities."
      }
    },
    {
      "@type": "Question",
      "name": "What is wallet integration and why is it important?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Wallet integration involves linking a digital wallet, like MetaMask, to your Gitcoin account. This allows for seamless cryptocurrency transactions when you participate in bounties, grants, or other activities."
      }
    },
    {
      "@type": "Question",
      "name": "How can developers contribute using Gitcoin?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Developers can contribute by working on tasks under Bounties, participating in Hackathons, and collaborating with project maintainers to submit work and innovative solutions."
      }
    },
    {
      "@type": "Question",
      "name": "How can funders participate in Gitcoin?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Funders can participate by supporting projects through Grants, posting bounties, and sponsoring events, defining deliverables, and using cryptocurrency for transactions."
      }
    },
    {
      "@type": "Question",
      "name": "How can I engage with the Gitcoin community?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Join the Gitcoin Discord and social media channels to engage in discussions and updates. Additionally, contribute to forums and feedback channels to help influence platform growth."
      }
    }
  ]
}