{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What is open-source hardware (OSH)?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Open-source hardware makes physical device designs accessible to anyone for modification and redistribution, promoting transparency and cooperation. The Open Source Hardware Association provides further details on OSH."
      }
    },
    {
      "@type": "Question",
      "name": "How does open-source hardware contribute to sustainability?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Open-source hardware contributes to sustainability by promoting resource efficiency through modular designs, enabling local manufacturing to reduce emissions, supporting circular economy practices, and fostering global knowledge sharing."
      }
    },
    {
      "@type": "Question",
      "name": "What role does Infineon Technologies play in open-source hardware?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Infineon Technologies showcases leadership in sustainable technological progress by developing open-source reference designs, promoting power efficiency, and supporting IoT innovations. Infineon also builds communities through workshops and hackathons."
      }
    },
    {
      "@type": "Question",
      "name": "What are some challenges faced by open-source hardware in promoting sustainability?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "OSH faces challenges including balancing intellectual property rights with open collaboration, ensuring quality control, managing economic considerations, and effectively engaging with communities."
      }
    },
    {
      "@type": "Question",
      "name": "What future trends are anticipated for open-source hardware and sustainability?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Future trends in open-source hardware include integration with AI and ML for energy management, eco-friendly designs inspired by biomimicry, and decentralized manufacturing using digital fabrication to strengthen local economies while reducing emissions."
      }
    }
  ]
}